In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

from numpy.random import randn

In [2]:
ser1 = Series([0,1,2],index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [3]:
ser2 = Series([3,4,5,6],index=['a','b','c','d'])
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [4]:
# pd added the values where index match, it will replace last value with a null since the first series didnt have the 4th index
ser1+ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [8]:
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=['A','B'],index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [10]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('abc'),index=['NYC','LA','SF'])
dframe2

     a  b  c
NYC  0  1  2
LA   3  4  5
SF   6  7  8

In [11]:
# adding 2 dframes together, all values which indexes do not match up will have null values
dframe1 + dframe2

      A   B   a   b   c
LA  NaN NaN NaN NaN NaN
NYC NaN NaN NaN NaN NaN
SF  NaN NaN NaN NaN NaN

In [13]:
# to avoid/minimize null values, fill value = 0 to replace null values to original dframe1. 
dframe1.add(dframe2, fill_value=0)

       A    B    a    b    c
LA   2.0  3.0  3.0  4.0  5.0
NYC  0.0  1.0  0.0  1.0  2.0
SF   NaN  NaN  6.0  7.0  8.0

In [20]:
ser3 = dframe2.iloc[0]
ser3

a    0
b    1
c    2
Name: NYC, dtype: int32

In [21]:
# subtracting values from a dframe
dframe2-ser3

     a  b  c
NYC  0  0  0
LA   3  3  3
SF   6  6  6